#Задание 2: Площадь прямоугольника
l=int(input("Введите длину прямоугольника: "))
w=int(input("Введите ширину прямоугольника: "))
print("Площадь прямоугольника:",l*w)
