#Задание 3: Конвертер температур
d=float(input("Введите температуру в градусах Цельсия: "))
print(str(d)+ "°C это", str(d*9/5+32)+ "°F")