#Задание 6: Калькулятор
a=int(input("Введите первое число: "))
b=int(input("Введите второе число: "))
o = input("Выберите оператор (+, -, *, /,**): ")
if o=="+":
    print("Результат:", f"{a} + {b} = {a + b}")
elif o=="-":
    print("Результат:", f"{a} - {b} = {a - b}")
elif o=="*":
    print("Результат:", f"{a} * {b} = {a * b}")
elif o == "/":
    if b != 0:
        print("Результат:", f"{a} / {b} = {a / b}")
    else:
        print("Ошибка: деление на ноль!")
elif o == "**":
    print("Результат:", f"{a} ** {b} = {a ** b}")
else:
    print("Ошибка: неизвестный оператор")


