#Задание 5: Проверка числа на чётность
a=int(input("Введите целое число: "))
if a%2==0:
    print("Число", a, "- четное.")
else:
    print("Число", a, "- нечетное.")