#Задача 2: Обратный отсчет до запуска
a=int(input("Введите число для обратного отсчета: "))
for a in range(a, 0, -1):
    print(f"{a}...")
print("GO!");
